src/cfe/КСП/InformationRegisters/КСП_МэппингХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КСП_МэппингХозяйственныеОперации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/ксп_МэппингХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксп_МэппингХозяйственныеОперации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/КСП_МэппингХозяйственныеОперации/Ext/ManagerModule.bsl
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ПоМэппингу(ГУИД, ВнешняяСистема) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рег.ХозяйственнаяОперация КАК ХозяйственнаяОперация
		|ИЗ
		|	РегистрСведений.ксп_МэппингХозяйственныеОперации КАК Рег
		|ГДЕ
		|	Рег.GUID = &ГУИД
		|	И Рег.ВнешняяСистема = &ВнешняяСистема";
	
	Если ГУИД = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ГУИД) Тогда
		Возврат Неопределено;
	КонецЕсли;    
	
	Запрос.УстановитьПараметр("ГУИД", ГУИД);
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ХозяйственнаяОперация;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции




//Функция ЕстьЗначение(Значение, ВнешняяСистема) Экспорт
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ 1
//		|ИЗ
//		|	РегистрСведений.ксп_МэппингВидыНоменклатуры КАК Рег
//		|ГДЕ
//		|	Рег.GUID = &GUID
//		|	И Рег.ВнешняяСистема = &ВнешняяСистема";
//	
//	Запрос.УстановитьПараметр("GUID", GUID);
//	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
//	
//	РезультатЗапроса = Запрос.Выполнить(); 
//	
//	Возврат НЕ РезультатЗапроса.Пустой();
//		
//КонецФункции


//// Описание_метода
////
//// Параметры:
////	Параметр1 	- Тип1 - 
////
//Процедура ДобавитьЗначение(GUID, Наименование, ВнешняяСистема) Экспорт
//	
//	НЗ = РегистрыСведений.ксп_МэппингВидыНоменклатуры.СоздатьНаборЗаписей();
//	НЗ.Отбор.GUID.Установить(GUID);
//	НЗ.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
//	стрк = НЗ.Добавить();
//	стрк.GUID = GUID;
//	стрк.Наименование = Наименование;  
//	стрк.ВнешняяСистема = ВнешняяСистема;	
//	НЗ.Записать();
//		
//КонецПроцедуры

//Процедура ДобавитьЗапись(GUID, Наименование, ВнешняяСистема, Ссылка) Экспорт
//	
//	НЗ = РегистрыСведений.ксп_МэппингВидыНоменклатуры.СоздатьНаборЗаписей();
//	НЗ.Отбор.GUID.Установить(GUID);
//	НЗ.Отбор.ВнешняяСистема.Установить(ВнешняяСистема);
//	стрк = НЗ.Добавить();
//	стрк.GUID = GUID;
//	стрк.Наименование = Наименование;  
//	стрк.ВнешняяСистема = ВнешняяСистема;	
//	
//	стрк.ВидНоменклатуры = Ссылка;
//	
//	НЗ.Записать();
//		
//КонецПроцедуры
